;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! doom-themes)

(package! prettier-js)
(package! request)
(package! indium)
(package! add-node-modules-path)
(package! js2-mode)
(package! flow-js2-mode)
(package! rjsx-mode)
(package! web-mode)
(package! es-mode)
(package! lsp-mode)

(package! fzf)
(package! graphql)

(package! yasnippet)
(package! react-snippets)

(package! company)
(package! company-lsp)
(package! company-files)
(package! company-box)

(package! editorconfig)
(package! golden-ratio)
(package! expand-region)
